[Survived] BlockStatement
src/assets/HelloWorld.jsx:1:22
-function HelloWorld(){
-
-    return <h1 className="text-center"> HELLO SWARNIM  </h1>
-
-}
+function HelloWorld(){}
 
 export default HelloWorld
