[Killed] BlockStatement
src/components/LoginPage.jsx:13:35
   const navigate = useNavigate();
 
   // Email validation using regex
-  const isValidEmail = (email) => {
-    const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
-    return emailRegex.test(email);
-  };
+  const isValidEmail = (email) => {};
 
   // Password validation: at least 8 characters, one uppercase, one lowercase, one number, and one special character
killedBy: LoginPage Component shows an error if password is weak
statusReason: 
Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="login-container"
    >

[Killed] Regex
src/components/LoginPage.jsx:14:24
 
   // Email validation using regex
   const isValidEmail = (email) => {
-    const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+    const emailRegex = /^[^\s@]+@[^\S@]+\.[^\s@]+$/;
     return emailRegex.test(email);
   };
killedBy: LoginPage Component shows an error if password is weak
statusReason: 
Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="login-container"
    >

[Killed] Regex
src/components/LoginPage.jsx:14:24
 
   // Email validation using regex
   const isValidEmail = (email) => {
-    const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+    const emailRegex = /^[^\s@]+@[^\s@]+\.[^\S@]+$/;
     return emailRegex.test(email);
   };
killedBy: LoginPage Component shows an error if password is weak
statusReason: 
Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="login-container"
    >

[Killed] BlockStatement
src/components/LoginPage.jsx:19:42
   };
 
   // Password validation: at least 8 characters, one uppercase, one lowercase, one number, and one special character
-  const isStrongPassword = (password) => {
-    const passwordRegex = /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?=.*[@$!%*?&])[A-Za-z\d@$!%*?&]{8,}$/;
-    return passwordRegex.test(password);
-  };
+  const isStrongPassword = (password) => {};
 
   // Handle form submission
killedBy: LoginPage Component calls the login API and handles successful login
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:8080/api/auth/login", {"password": "Chitransh07&", "username": "ck@gmail.com"}

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] Regex
src/components/LoginPage.jsx:20:27
 
   // Password validation: at least 8 characters, one uppercase, one lowercase, one number, and one special character
   const isStrongPassword = (password) => {
-    const passwordRegex = /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?=.*[@$!%*?&])[A-Za-z\d@$!%*?&]{8,}$/;
+    const passwordRegex = /^(?=.*[a-z])(?=.*[A-Z])(?=.\d)(?=.*[@$!%*?&])[A-Za-z\d@$!%*?&]{8,}$/;
     return passwordRegex.test(password);
   };
killedBy: LoginPage Component calls the login API and handles successful login
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:8080/api/auth/login", {"password": "Chitransh07&", "username": "ck@gmail.com"}

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] Regex
src/components/LoginPage.jsx:20:27
 
   // Password validation: at least 8 characters, one uppercase, one lowercase, one number, and one special character
   const isStrongPassword = (password) => {
-    const passwordRegex = /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?=.*[@$!%*?&])[A-Za-z\d@$!%*?&]{8,}$/;
+    const passwordRegex = /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?=.[@$!%*?&])[A-Za-z\d@$!%*?&]{8,}$/;
     return passwordRegex.test(password);
   };
killedBy: LoginPage Component calls the login API and handles successful login
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:8080/api/auth/login", {"password": "Chitransh07&", "username": "ck@gmail.com"}

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] BooleanLiteral
src/components/LoginPage.jsx:30:19
     setError(''); // Reset any previous errors
 
     // Basic client-side validation
-    if (!email || !password) {
+    if (!email || password) {
       setError('All fields are required');
       return;
killedBy: LoginPage Component shows an error if email is invalid
statusReason: Error: Unable to find an element with the text: Please enter a valid email address. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="login-container"
    >

[Killed] ConditionalExpression
src/components/LoginPage.jsx:30:9
     setError(''); // Reset any previous errors
 
     // Basic client-side validation
-    if (!email || !password) {
+    if (false) {
       setError('All fields are required');
       return;
killedBy: LoginPage Component shows an error if email or password is missing
statusReason: Error: Unable to find an element with the text: All fields are required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="login-container"
    >

[Killed] BlockStatement
src/components/LoginPage.jsx:35:31
       return;
     }
 
-    if (!isValidEmail(email)) {
-      setError('Please enter a valid email address');
-      return;
-    }
+    if (!isValidEmail(email)) {}
 
     if (!isStrongPassword(password)) {
killedBy: LoginPage Component shows an error if email is invalid
statusReason: Error: Unable to find an element with the text: Please enter a valid email address. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="login-container"
    >

[Killed] ConditionalExpression
src/components/LoginPage.jsx:35:9
       return;
     }
 
-    if (!isValidEmail(email)) {
+    if (false) {
       setError('Please enter a valid email address');
       return;
killedBy: LoginPage Component shows an error if email is invalid
statusReason: Error: Unable to find an element with the text: Please enter a valid email address. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="login-container"
    >

[Killed] BlockStatement
src/components/LoginPage.jsx:40:38
       return;
     }
 
-    if (!isStrongPassword(password)) {
-      setError('Password must be at least 8 characters long, contain an uppercase letter, a lowercase letter, a number, and a special character');
-      return;
-    }
+    if (!isStrongPassword(password)) {}
 
     try {
killedBy: LoginPage Component shows an error if password is weak
statusReason: 
Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="login-container"
    >

[Killed] BooleanLiteral
src/components/LoginPage.jsx:40:9
       return;
     }
 
-    if (!isStrongPassword(password)) {
+    if (isStrongPassword(password)) {
       setError('Password must be at least 8 characters long, contain an uppercase letter, a lowercase letter, a number, and a special character');
       return;
killedBy: LoginPage Component shows an error if password is weak
statusReason: 
Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="login-container"
    >

[Killed] StringLiteral
src/components/LoginPage.jsx:41:16
     }
 
     if (!isStrongPassword(password)) {
-      setError('Password must be at least 8 characters long, contain an uppercase letter, a lowercase letter, a number, and a special character');
+      setError("");
       return;
     }
killedBy: LoginPage Component shows an error if password is weak
statusReason: 
Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="login-container"
    >

[Killed] BlockStatement
src/components/LoginPage.jsx:45:9
       return;
     }
 
-    try {
-      // Make API request to backend
-      const response = await axios.post('http://localhost:8080/api/auth/login', {
-        username: email,
-        password,
-      });
-
-      if (response.status === 200) {
-        // If successful, notify the parent component (App) that the user is authenticated
-        onLogin(true);
-
-        // Redirect to the main page (or any other page that requires authentication)
-        navigate('/departments');
-      } else {
-        setError('Invalid email or password');
-      }
-    } catch (error) {
+    try {} catch (error) {
       setError('Login failed, please try again');
     }
killedBy: LoginPage Component calls the login API and handles successful login
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:8080/api/auth/login", {"password": "Chitransh07&", "username": "ck@gmail.com"}

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
src/components/LoginPage.jsx:47:41
 
     try {
       // Make API request to backend
-      const response = await axios.post('http://localhost:8080/api/auth/login', {
+      const response = await axios.post("", {
         username: email,
         password,
killedBy: LoginPage Component calls the login API and handles successful login
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "http://localhost:8080/api/auth/login",
+ "",
  {"password": "Chitransh07&", "username": "ck@gmail.com"},

[Killed] BlockStatement
src/components/LoginPage.jsx:52:36
         password,
       });
 
-      if (response.status === 200) {
-        // If successful, notify the parent component (App) that the user is authenticated
-        onLogin(true);
-
-        // Redirect to the main page (or any other page that requires authentication)
-        navigate('/departments');
-      } else {
+      if (response.status === 200) {} else {
         setError('Invalid email or password');
       }
killedBy: LoginPage Component calls the login API and handles successful login
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: true

Number of calls: 0

[Killed] EqualityOperator
src/components/LoginPage.jsx:52:11
         password,
       });
 
-      if (response.status === 200) {
+      if (response.status !== 200) {
         // If successful, notify the parent component (App) that the user is authenticated
         onLogin(true);
killedBy: LoginPage Component calls the login API and handles successful login
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: true

Number of calls: 0

[Killed] BooleanLiteral
src/components/LoginPage.jsx:54:17
 
       if (response.status === 200) {
         // If successful, notify the parent component (App) that the user is authenticated
-        onLogin(true);
+        onLogin(false);
 
         // Redirect to the main page (or any other page that requires authentication)
killedBy: LoginPage Component calls the login API and handles successful login
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: true
Received: false

Number of calls: 1

[Survived] BlockStatement
src/components/LoginPage.jsx:58:14
 
         // Redirect to the main page (or any other page that requires authentication)
         navigate('/departments');
-      } else {
-        setError('Invalid email or password');
-      }
+      } else {}
     } catch (error) {
       setError('Login failed, please try again');

[Killed] BlockStatement
src/components/LoginPage.jsx:61:21
       } else {
         setError('Invalid email or password');
       }
-    } catch (error) {
-      setError('Login failed, please try again');
-    }
+    } catch (error) {}
   };
 
killedBy: LoginPage Component handles login failure
statusReason: Error: Unable to find an element with the text: Login failed, please try again. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="login-container"
    >

[Killed] ConditionalExpression
src/components/LoginPage.jsx:70:10
     <div className="login-container">
       <h2 className="login-title">Login</h2>
       <form className="login-form" onSubmit={handleLogin} role="form">
-        {error && <div className="error-message">{error}</div>}
+        {true}
         <div className="form-group">
           <label htmlFor="email">Email:</label>
killedBy: LoginPage Component shows an error if email or password is missing
statusReason: Error: Unable to find an element with the text: All fields are required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="login-container"
    >

[Killed] ConditionalExpression
src/components/LoginPage.jsx:70:10
     <div className="login-container">
       <h2 className="login-title">Login</h2>
       <form className="login-form" onSubmit={handleLogin} role="form">
-        {error && <div className="error-message">{error}</div>}
+        {false}
         <div className="form-group">
           <label htmlFor="email">Email:</label>
killedBy: LoginPage Component shows an error if email or password is missing
statusReason: Error: Unable to find an element with the text: All fields are required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="login-container"
    >
