[Killed] BlockStatement
src/components/DepartmentComponent.jsx:13:19
 
   const navigate = useNavigate();
 
-  useEffect(() => {
-    // Only call getDepartmentById if an id exists (for editing)
-    if (id) {
-      getDepartmentById(id)
-        .then((response) => {
-          setDepartmentName(response.data.departmentName);
-          setDepartmentDescription(response.data.departmentDescription);
-        })
-        .catch((error) => {
-          console.error(error);
-        });
-    }
-  }, [id]);
+  useEffect(() => {}, [id]);
 
   const saveOrUpdateDepartment = (e) => {
killedBy: DepartmentComponent submits form to update an existing department
statusReason: Error: Unable to find an element with the display value: HR.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container"
    >

[Killed] BlockStatement
src/components/DepartmentComponent.jsx:15:13
 
   useEffect(() => {
     // Only call getDepartmentById if an id exists (for editing)
-    if (id) {
-      getDepartmentById(id)
-        .then((response) => {
-          setDepartmentName(response.data.departmentName);
-          setDepartmentDescription(response.data.departmentDescription);
-        })
-        .catch((error) => {
-          console.error(error);
-        });
-    }
+    if (id) {}
   }, [id]);
 
killedBy: DepartmentComponent submits form to update an existing department
statusReason: Error: Unable to find an element with the display value: HR.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container"
    >

[Killed] ConditionalExpression
src/components/DepartmentComponent.jsx:15:9
 
   useEffect(() => {
     // Only call getDepartmentById if an id exists (for editing)
-    if (id) {
+    if (false) {
       getDepartmentById(id)
         .then((response) => {
killedBy: DepartmentComponent submits form to update an existing department
statusReason: Error: Unable to find an element with the display value: HR.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container"
    >

[Killed] BlockStatement
src/components/DepartmentComponent.jsx:17:29
     // Only call getDepartmentById if an id exists (for editing)
     if (id) {
       getDepartmentById(id)
-        .then((response) => {
-          setDepartmentName(response.data.departmentName);
-          setDepartmentDescription(response.data.departmentDescription);
-        })
+        .then((response) => {})
         .catch((error) => {
           console.error(error);
killedBy: DepartmentComponent submits form to update an existing department
statusReason: Error: Unable to find an element with the display value: HR.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container"
    >

[Survived] BlockStatement
src/components/DepartmentComponent.jsx:21:27
           setDepartmentName(response.data.departmentName);
           setDepartmentDescription(response.data.departmentDescription);
         })
-        .catch((error) => {
-          console.error(error);
-        });
+        .catch((error) => {});
     }
   }, [id]);

[Killed] BlockStatement
src/components/DepartmentComponent.jsx:27:41
     }
   }, [id]);
 
-  const saveOrUpdateDepartment = (e) => {
-    e.preventDefault();
-
-    const department = { departmentName, departmentDescription };
-
-    if (id) {
-      updateDepartment(id, department)
-        .then((response) => {
-          console.log(response.data);
-          navigate('/departments');
-        })
-        .catch((error) => {
-          console.error(error);
-        });
-    } else {
-      createDepartment(department)
-        .then((response) => {
-          navigate('/departments');
-        })
-        .catch((error) => {
-          console.error(error);
-        });
-    }
-  };
+  const saveOrUpdateDepartment = (e) => {};
 
   const pageTitle = () => {
killedBy: DepartmentComponent submits form to create a new department
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/departments"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
src/components/DepartmentComponent.jsx:32:13
 
     const department = { departmentName, departmentDescription };
 
-    if (id) {
-      updateDepartment(id, department)
-        .then((response) => {
-          console.log(response.data);
-          navigate('/departments');
-        })
-        .catch((error) => {
-          console.error(error);
-        });
-    } else {
+    if (id) {} else {
       createDepartment(department)
         .then((response) => {
killedBy: DepartmentComponent submits form to update an existing department
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/departments"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
src/components/DepartmentComponent.jsx:34:29
 
     if (id) {
       updateDepartment(id, department)
-        .then((response) => {
-          console.log(response.data);
-          navigate('/departments');
-        })
+        .then((response) => {})
         .catch((error) => {
           console.error(error);
killedBy: DepartmentComponent submits form to update an existing department
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/departments"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
src/components/DepartmentComponent.jsx:41:12
         .catch((error) => {
           console.error(error);
         });
-    } else {
-      createDepartment(department)
-        .then((response) => {
-          navigate('/departments');
-        })
-        .catch((error) => {
-          console.error(error);
-        });
-    }
+    } else {}
   };
 
killedBy: DepartmentComponent submits form to create a new department
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/departments"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
src/components/DepartmentComponent.jsx:43:29
         });
     } else {
       createDepartment(department)
-        .then((response) => {
-          navigate('/departments');
-        })
+        .then((response) => {})
         .catch((error) => {
           console.error(error);
killedBy: DepartmentComponent submits form to create a new department
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/departments"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Survived] BlockStatement
src/components/DepartmentComponent.jsx:52:27
     }
   };
 
-  const pageTitle = () => {
-    if (id) {
-      return <h2 className='text-center'>Update Department</h2>;
-    } else {
-      return <h2 className='text-center'>Add Department</h2>;
-    }
-  };
+  const pageTitle = () => {};
 
   return (

[Survived] BlockStatement
src/components/DepartmentComponent.jsx:53:13
   };
 
   const pageTitle = () => {
-    if (id) {
-      return <h2 className='text-center'>Update Department</h2>;
-    } else {
+    if (id) {} else {
       return <h2 className='text-center'>Add Department</h2>;
     }

[Survived] ConditionalExpression
src/components/DepartmentComponent.jsx:53:9
   };
 
   const pageTitle = () => {
-    if (id) {
+    if (false) {
       return <h2 className='text-center'>Update Department</h2>;
     } else {

[Survived] BlockStatement
src/components/DepartmentComponent.jsx:55:12
   const pageTitle = () => {
     if (id) {
       return <h2 className='text-center'>Update Department</h2>;
-    } else {
-      return <h2 className='text-center'>Add Department</h2>;
-    }
+    } else {}
   };
 

[Killed] ArrowFunction
src/components/DepartmentComponent.jsx:76:29
                   name='departmentName'
                   placeholder='Enter Department Name'
                   value={departmentName}
-                  onChange={(e) => setDepartmentName(e.target.value)}
+                  onChange={() => undefined}
                   className='form-control'
                 />
killedBy: DepartmentComponent submits form to create a new department
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "departmentDescription": "Human Resources",
-   "departmentName": "HR",

[Killed] ArrowFunction
src/components/DepartmentComponent.jsx:88:29
                   name='departmentDescription'
                   placeholder='Enter Department Description'
                   value={departmentDescription}
-                  onChange={(e) => setDepartmentDescription(e.target.value)}
+                  onChange={() => undefined}
                   className='form-control'
                 />
killedBy: DepartmentComponent submits form to create a new department
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "departmentDescription": "Human Resources",
+   "departmentDescription": "",
