[Survived] StringLiteral
src/components/EmployeeComponent.jsx:6:48
 import { useNavigate, useParams } from 'react-router-dom';
 
 const EmployeeComponent = () => {
-    const [firstName, setFirstName] = useState('');
+    const [firstName, setFirstName] = useState("Stryker was here!");
     const [lastName, setLastName] = useState('');
     const [email, setEmail] = useState('');

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:9:42
     const [firstName, setFirstName] = useState('');
     const [lastName, setLastName] = useState('');
     const [email, setEmail] = useState('');
-    const [gender, setGender] = useState('');
+    const [gender, setGender] = useState("Stryker was here!");
     const [phoneNumber, setPhoneNumber] = useState('');
     const [birthdate, setBirthdate] = useState('');

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:10:52
     const [lastName, setLastName] = useState('');
     const [email, setEmail] = useState('');
     const [gender, setGender] = useState('');
-    const [phoneNumber, setPhoneNumber] = useState('');
+    const [phoneNumber, setPhoneNumber] = useState("Stryker was here!");
     const [birthdate, setBirthdate] = useState('');
     const [city, setCity] = useState('');

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:13:40
     const [phoneNumber, setPhoneNumber] = useState('');
     const [birthdate, setBirthdate] = useState('');
     const [city, setCity] = useState('');
-    const [state, setState] = useState('');
+    const [state, setState] = useState("Stryker was here!");
     const [pincode, setPincode] = useState('');
     const [emergencyContact, setEmergencyContact] = useState('');

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:16:58
     const [state, setState] = useState('');
     const [pincode, setPincode] = useState('');
     const [emergencyContact, setEmergencyContact] = useState('');
-    const [employmentType, setEmploymentType] = useState('');
+    const [employmentType, setEmploymentType] = useState("Stryker was here!");
     const [startDate, setStartDate] = useState('');
     const [departmentId, setDepartmentId] = useState('');

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:17:48
     const [pincode, setPincode] = useState('');
     const [emergencyContact, setEmergencyContact] = useState('');
     const [employmentType, setEmploymentType] = useState('');
-    const [startDate, setStartDate] = useState('');
+    const [startDate, setStartDate] = useState("Stryker was here!");
     const [departmentId, setDepartmentId] = useState('');
     const [departments, setDepartments] = useState([]);

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:18:54
     const [emergencyContact, setEmergencyContact] = useState('');
     const [employmentType, setEmploymentType] = useState('');
     const [startDate, setStartDate] = useState('');
-    const [departmentId, setDepartmentId] = useState('');
+    const [departmentId, setDepartmentId] = useState("Stryker was here!");
     const [departments, setDepartments] = useState([]);
 

[Killed] BlockStatement
src/components/EmployeeComponent.jsx:21:21
     const [departmentId, setDepartmentId] = useState('');
     const [departments, setDepartments] = useState([]);
 
-    useEffect(() => {
-        getAllDepartments().then((response) => {
-            setDepartments(response.data);
-        }).catch(error => {
-            console.error(error);
-        });
-    }, []);
+    useEffect(() => {}, []);
 
     const { id } = useParams();
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
src/components/EmployeeComponent.jsx:22:48
     const [departments, setDepartments] = useState([]);
 
     useEffect(() => {
-        getAllDepartments().then((response) => {
-            setDepartments(response.data);
-        }).catch(error => {
+        getAllDepartments().then((response) => {}).catch(error => {
             console.error(error);
         });
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] BlockStatement
src/components/EmployeeComponent.jsx:24:27
     useEffect(() => {
         getAllDepartments().then((response) => {
             setDepartments(response.data);
-        }).catch(error => {
-            console.error(error);
-        });
+        }).catch(error => {});
     }, []);
 

[Survived] ObjectLiteral
src/components/EmployeeComponent.jsx:30:42
     }, []);
 
     const { id } = useParams();
-    const [errors, setErrors] = useState({
-        firstName: '',
-        lastName: '',
-        email: '',
-        gender: '',
-        phoneNumber: '',
-        birthdate: '',
-        city: '',
-        state: '',
-        pincode: '',
-        emergencyContact: '',
-        employmentType: '',
-        startDate: '',
-        department: ''
-    });
+    const [errors, setErrors] = useState({});
     const navigate = useNavigate();
 

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:31:20
 
     const { id } = useParams();
     const [errors, setErrors] = useState({
-        firstName: '',
+        firstName: "Stryker was here!",
         lastName: '',
         email: '',

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:38:16
         phoneNumber: '',
         birthdate: '',
         city: '',
-        state: '',
+        state: "Stryker was here!",
         pincode: '',
         emergencyContact: '',

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:40:27
         city: '',
         state: '',
         pincode: '',
-        emergencyContact: '',
+        emergencyContact: "Stryker was here!",
         employmentType: '',
         startDate: '',

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:42:20
         pincode: '',
         emergencyContact: '',
         employmentType: '',
-        startDate: '',
+        startDate: "Stryker was here!",
         department: ''
     });

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:43:21
         emergencyContact: '',
         employmentType: '',
         startDate: '',
-        department: ''
+        department: "Stryker was here!"
     });
     const navigate = useNavigate();

[Survived] BlockStatement
src/components/EmployeeComponent.jsx:47:21
     });
     const navigate = useNavigate();
 
-    useEffect(() => {
-        if (id) {
-            getEmployee(id).then((response) => {
-                const data = response.data;
-                setFirstName(data.firstName);
-                setLastName(data.lastName);
-                setEmail(data.email);
-                setGender(data.gender);
-                setPhoneNumber(data.phoneNumber);
-                setBirthdate(data.birthdate);
-                setCity(data.city);
-                setState(data.state);
-                setPincode(data.pincode);
-                setEmergencyContact(data.emergencyContact);
-                setEmploymentType(data.employmentType);
-                setStartDate(data.startDate);
-                setDepartmentId(data.departmentId);
-            }).catch(error => {
-                console.error(error);
-            });
-        }
-    }, [id]);
+    useEffect(() => {}, [id]);
 
     const handleChange = (e, setStateFunction) => {

[Killed] ConditionalExpression
src/components/EmployeeComponent.jsx:48:13
     const navigate = useNavigate();
 
     useEffect(() => {
-        if (id) {
+        if (true) {
             getEmployee(id).then((response) => {
                 const data = response.data;
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: TypeError: Cannot read properties of undefined (reading 'then')

[Survived] ConditionalExpression
src/components/EmployeeComponent.jsx:48:13
     const navigate = useNavigate();
 
     useEffect(() => {
-        if (id) {
+        if (false) {
             getEmployee(id).then((response) => {
                 const data = response.data;

[Survived] BlockStatement
src/components/EmployeeComponent.jsx:49:48
 
     useEffect(() => {
         if (id) {
-            getEmployee(id).then((response) => {
-                const data = response.data;
-                setFirstName(data.firstName);
-                setLastName(data.lastName);
-                setEmail(data.email);
-                setGender(data.gender);
-                setPhoneNumber(data.phoneNumber);
-                setBirthdate(data.birthdate);
-                setCity(data.city);
-                setState(data.state);
-                setPincode(data.pincode);
-                setEmergencyContact(data.emergencyContact);
-                setEmploymentType(data.employmentType);
-                setStartDate(data.startDate);
-                setDepartmentId(data.departmentId);
-            }).catch(error => {
+            getEmployee(id).then((response) => {}).catch(error => {
                 console.error(error);
             });

[Survived] BlockStatement
src/components/EmployeeComponent.jsx:64:31
                 setEmploymentType(data.employmentType);
                 setStartDate(data.startDate);
                 setDepartmentId(data.departmentId);
-            }).catch(error => {
-                console.error(error);
-            });
+            }).catch(error => {});
         }
     }, [id]);

[Killed] BlockStatement
src/components/EmployeeComponent.jsx:70:51
         }
     }, [id]);
 
-    const handleChange = (e, setStateFunction) => {
-        setStateFunction(e.target.value);
-    };
+    const handleChange = (e, setStateFunction) => {};
 
     const saveOrUpdateEmployee = (e) => {
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
src/components/EmployeeComponent.jsx:77:13
     const saveOrUpdateEmployee = (e) => {
         e.preventDefault();
 
-        if (validateForm()) {
+        if (false) {
             const employee = {
                 firstName, lastName, email, gender, phoneNumber, birthdate, city,
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
src/components/EmployeeComponent.jsx:77:13
     const saveOrUpdateEmployee = (e) => {
         e.preventDefault();
 
-        if (validateForm()) {
+        if (true) {
             const employee = {
                 firstName, lastName, email, gender, phoneNumber, birthdate, city,
killedBy: EmployeeComponent Tests does not call API if form data is invalid
statusReason: Error: Unable to find an element with the text: function (content, element) { return content.includes('Email is Required') || content.includes('Email must contain "@" and "."'); } (normalized from 'function (content, element) {
            return content.includes('Email is Required') || content.includes('Email must contain "@" and "."');
          }'). This could be because the text is broken up b

[Survived] ConditionalExpression
src/components/EmployeeComponent.jsx:84:17
             };
             console.log(employee);
 
-            if (id) {
+            if (false) {
                 updateEmployee(id, employee).then((response) => {
                     console.log(response.data);

[Survived] BlockStatement
src/components/EmployeeComponent.jsx:85:65
             console.log(employee);
 
             if (id) {
-                updateEmployee(id, employee).then((response) => {
-                    console.log(response.data);
-                    navigate('/employee');
-                }).catch(error => {
+                updateEmployee(id, employee).then((response) => {}).catch(error => {
                     console.error(error);
                 });

[Survived] BlockStatement
src/components/EmployeeComponent.jsx:88:35
                 updateEmployee(id, employee).then((response) => {
                     console.log(response.data);
                     navigate('/employee');
-                }).catch(error => {
-                    console.error(error);
-                });
+                }).catch(error => {});
             } else {
                 createEmployee(employee).then((response) => {

[Killed] BlockStatement
src/components/EmployeeComponent.jsx:91:20
                 }).catch(error => {
                     console.error(error);
                 });
-            } else {
-                createEmployee(employee).then((response) => {
-                    console.log(response.data);
-                    navigate('/employee');
-                }).catch(errors => {
-                    console.error(errors);
-                });
-            }
+            } else {}
         }
     };
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] BlockStatement
src/components/EmployeeComponent.jsx:92:61
                     console.error(error);
                 });
             } else {
-                createEmployee(employee).then((response) => {
-                    console.log(response.data);
-                    navigate('/employee');
-                }).catch(errors => {
+                createEmployee(employee).then((response) => {}).catch(errors => {
                     console.error(errors);
                 });

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:94:30
             } else {
                 createEmployee(employee).then((response) => {
                     console.log(response.data);
-                    navigate('/employee');
+                    navigate("");
                 }).catch(errors => {
                     console.error(errors);

[Survived] BlockStatement
src/components/EmployeeComponent.jsx:95:36
                 createEmployee(employee).then((response) => {
                     console.log(response.data);
                     navigate('/employee');
-                }).catch(errors => {
-                    console.error(errors);
-                });
+                }).catch(errors => {});
             }
         }

[Killed] BooleanLiteral
src/components/EmployeeComponent.jsx:103:21
     };
 
     const validateForm = () => {
-        let valid = true;
+        let valid = false;
         const errorsCopy = { ...errors };
 
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] Regex
src/components/EmployeeComponent.jsx:106:30
         let valid = true;
         const errorsCopy = { ...errors };
 
-        const emailPattern = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+        const emailPattern = /^[^\s@]+@[^\s@]+\.[\s@]+$/;
         const phonePattern = /^[0-9]{10}$/;
         const pincodePattern = /^[0-9]{6}$/;
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] Regex
src/components/EmployeeComponent.jsx:106:30
         let valid = true;
         const errorsCopy = { ...errors };
 
-        const emailPattern = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+        const emailPattern = /^[^\S@]+@[^\s@]+\.[^\s@]+$/;
         const phonePattern = /^[0-9]{10}$/;
         const pincodePattern = /^[0-9]{6}$/;
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] Regex
src/components/EmployeeComponent.jsx:107:30
         const errorsCopy = { ...errors };
 
         const emailPattern = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
-        const phonePattern = /^[0-9]{10}$/;
+        const phonePattern = /^[^0-9]{10}$/;
         const pincodePattern = /^[0-9]{6}$/;
 
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] Regex
src/components/EmployeeComponent.jsx:108:32
 
         const emailPattern = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
         const phonePattern = /^[0-9]{10}$/;
-        const pincodePattern = /^[0-9]{6}$/;
+        const pincodePattern = /^[^0-9]{6}$/;
 
         if (firstName.trim()) {
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
src/components/EmployeeComponent.jsx:110:13
         const phonePattern = /^[0-9]{10}$/;
         const pincodePattern = /^[0-9]{6}$/;
 
-        if (firstName.trim()) {
+        if (false) {
             errorsCopy.firstName = '';
         } else {
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] MethodExpression
src/components/EmployeeComponent.jsx:110:13
         const phonePattern = /^[0-9]{10}$/;
         const pincodePattern = /^[0-9]{6}$/;
 
-        if (firstName.trim()) {
+        if (firstName) {
             errorsCopy.firstName = '';
         } else {

[Survived] BlockStatement
src/components/EmployeeComponent.jsx:112:16
 
         if (firstName.trim()) {
             errorsCopy.firstName = '';
-        } else {
-            errorsCopy.firstName = 'First Name is Required';
-            valid = false;
-        }
+        } else {}
 
         if (lastName.trim()) {

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:113:36
         if (firstName.trim()) {
             errorsCopy.firstName = '';
         } else {
-            errorsCopy.firstName = 'First Name is Required';
+            errorsCopy.firstName = "";
             valid = false;
         }

[Survived] BooleanLiteral
src/components/EmployeeComponent.jsx:114:21
             errorsCopy.firstName = '';
         } else {
             errorsCopy.firstName = 'First Name is Required';
-            valid = false;
+            valid = true;
         }
 

[Killed] ConditionalExpression
src/components/EmployeeComponent.jsx:117:13
             valid = false;
         }
 
-        if (lastName.trim()) {
+        if (false) {
             errorsCopy.lastName = '';
         } else {
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] MethodExpression
src/components/EmployeeComponent.jsx:117:13
             valid = false;
         }
 
-        if (lastName.trim()) {
+        if (lastName) {
             errorsCopy.lastName = '';
         } else {

[Survived] BlockStatement
src/components/EmployeeComponent.jsx:119:16
 
         if (lastName.trim()) {
             errorsCopy.lastName = '';
-        } else {
-            errorsCopy.lastName = 'Last Name is Required';
-            valid = false;
-        }
+        } else {}
 
         if (email.trim()) {

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:120:35
         if (lastName.trim()) {
             errorsCopy.lastName = '';
         } else {
-            errorsCopy.lastName = 'Last Name is Required';
+            errorsCopy.lastName = "";
             valid = false;
         }

[Survived] BooleanLiteral
src/components/EmployeeComponent.jsx:121:21
             errorsCopy.lastName = '';
         } else {
             errorsCopy.lastName = 'Last Name is Required';
-            valid = false;
+            valid = true;
         }
 

[Killed] ConditionalExpression
src/components/EmployeeComponent.jsx:124:13
             valid = false;
         }
 
-        if (email.trim()) {
+        if (false) {
             if (emailPattern.test(email)) {
                 errorsCopy.email = '';
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] MethodExpression
src/components/EmployeeComponent.jsx:124:13
             valid = false;
         }
 
-        if (email.trim()) {
+        if (email) {
             if (emailPattern.test(email)) {
                 errorsCopy.email = '';

[Killed] ConditionalExpression
src/components/EmployeeComponent.jsx:125:17
         }
 
         if (email.trim()) {
-            if (emailPattern.test(email)) {
+            if (false) {
                 errorsCopy.email = '';
             } else {
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] BlockStatement
src/components/EmployeeComponent.jsx:125:43
         }
 
         if (email.trim()) {
-            if (emailPattern.test(email)) {
-                errorsCopy.email = '';
-            } else {
+            if (emailPattern.test(email)) {} else {
                 errorsCopy.email = 'Email must contain "@" and "."';
                 valid = false;

[Survived] BlockStatement
src/components/EmployeeComponent.jsx:127:20
         if (email.trim()) {
             if (emailPattern.test(email)) {
                 errorsCopy.email = '';
-            } else {
-                errorsCopy.email = 'Email must contain "@" and "."';
-                valid = false;
-            }
+            } else {}
         } else {
             errorsCopy.email = 'Email is Required';

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:128:36
             if (emailPattern.test(email)) {
                 errorsCopy.email = '';
             } else {
-                errorsCopy.email = 'Email must contain "@" and "."';
+                errorsCopy.email = "";
                 valid = false;
             }

[Survived] BooleanLiteral
src/components/EmployeeComponent.jsx:129:25
                 errorsCopy.email = '';
             } else {
                 errorsCopy.email = 'Email must contain "@" and "."';
-                valid = false;
+                valid = true;
             }
         } else {

[Killed] BlockStatement
src/components/EmployeeComponent.jsx:131:16
                 errorsCopy.email = 'Email must contain "@" and "."';
                 valid = false;
             }
-        } else {
-            errorsCopy.email = 'Email is Required';
-            valid = false;
-        }
+        } else {}
 
         if (gender) {
killedBy: EmployeeComponent Tests does not call API if form data is invalid
statusReason: Error: Unable to find an element with the text: function (content, element) { return content.includes('Email is Required') || content.includes('Email must contain "@" and "."'); } (normalized from 'function (content, element) {
            return content.includes('Email is Required') || content.includes('Email must contain "@" and "."');
          }'). This could be because the text is broken up b

[Survived] BooleanLiteral
src/components/EmployeeComponent.jsx:133:21
             }
         } else {
             errorsCopy.email = 'Email is Required';
-            valid = false;
+            valid = true;
         }
 

[Killed] ConditionalExpression
src/components/EmployeeComponent.jsx:136:13
             valid = false;
         }
 
-        if (gender) {
+        if (false) {
             errorsCopy.gender = '';
         } else {
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] BlockStatement
src/components/EmployeeComponent.jsx:136:21
             valid = false;
         }
 
-        if (gender) {
-            errorsCopy.gender = '';
-        } else {
+        if (gender) {} else {
             errorsCopy.gender = 'Gender is Required';
             valid = false;

[Survived] BlockStatement
src/components/EmployeeComponent.jsx:138:16
 
         if (gender) {
             errorsCopy.gender = '';
-        } else {
-            errorsCopy.gender = 'Gender is Required';
-            valid = false;
-        }
+        } else {}
 
         if (phoneNumber.trim()) {

[Survived] BooleanLiteral
src/components/EmployeeComponent.jsx:140:21
             errorsCopy.gender = '';
         } else {
             errorsCopy.gender = 'Gender is Required';
-            valid = false;
+            valid = true;
         }
 

[Killed] ConditionalExpression
src/components/EmployeeComponent.jsx:143:13
             valid = false;
         }
 
-        if (phoneNumber.trim()) {
+        if (false) {
             if (phonePattern.test(phoneNumber)) {
                 errorsCopy.phoneNumber = '';
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] BlockStatement
src/components/EmployeeComponent.jsx:143:33
             valid = false;
         }
 
-        if (phoneNumber.trim()) {
-            if (phonePattern.test(phoneNumber)) {
-                errorsCopy.phoneNumber = '';
-            } else {
-                errorsCopy.phoneNumber = 'Phone Number must be 10 digits';
-                valid = false;
-            }
-        } else {
+        if (phoneNumber.trim()) {} else {
             errorsCopy.phoneNumber = 'Phone Number is Required';
             valid = false;

[Killed] ConditionalExpression
src/components/EmployeeComponent.jsx:144:17
         }
 
         if (phoneNumber.trim()) {
-            if (phonePattern.test(phoneNumber)) {
+            if (false) {
                 errorsCopy.phoneNumber = '';
             } else {
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] BlockStatement
src/components/EmployeeComponent.jsx:144:49
         }
 
         if (phoneNumber.trim()) {
-            if (phonePattern.test(phoneNumber)) {
-                errorsCopy.phoneNumber = '';
-            } else {
+            if (phonePattern.test(phoneNumber)) {} else {
                 errorsCopy.phoneNumber = 'Phone Number must be 10 digits';
                 valid = false;

[Survived] BlockStatement
src/components/EmployeeComponent.jsx:146:20
         if (phoneNumber.trim()) {
             if (phonePattern.test(phoneNumber)) {
                 errorsCopy.phoneNumber = '';
-            } else {
-                errorsCopy.phoneNumber = 'Phone Number must be 10 digits';
-                valid = false;
-            }
+            } else {}
         } else {
             errorsCopy.phoneNumber = 'Phone Number is Required';

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:147:42
             if (phonePattern.test(phoneNumber)) {
                 errorsCopy.phoneNumber = '';
             } else {
-                errorsCopy.phoneNumber = 'Phone Number must be 10 digits';
+                errorsCopy.phoneNumber = "";
                 valid = false;
             }

[Survived] BooleanLiteral
src/components/EmployeeComponent.jsx:148:25
                 errorsCopy.phoneNumber = '';
             } else {
                 errorsCopy.phoneNumber = 'Phone Number must be 10 digits';
-                valid = false;
+                valid = true;
             }
         } else {

[Survived] BlockStatement
src/components/EmployeeComponent.jsx:150:16
                 errorsCopy.phoneNumber = 'Phone Number must be 10 digits';
                 valid = false;
             }
-        } else {
-            errorsCopy.phoneNumber = 'Phone Number is Required';
-            valid = false;
-        }
+        } else {}
 
         if (birthdate) {

[Survived] BooleanLiteral
src/components/EmployeeComponent.jsx:152:21
             }
         } else {
             errorsCopy.phoneNumber = 'Phone Number is Required';
-            valid = false;
+            valid = true;
         }
 
