[Killed] ConditionalExpression
src/components/EmployeeComponent.jsx:155:13
             valid = false;
         }
 
-        if (birthdate) {
+        if (false) {
             errorsCopy.birthdate = '';
         } else {
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] ConditionalExpression
src/components/EmployeeComponent.jsx:155:13
             valid = false;
         }
 
-        if (birthdate) {
+        if (true) {
             errorsCopy.birthdate = '';
         } else {

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:156:36
         }
 
         if (birthdate) {
-            errorsCopy.birthdate = '';
+            errorsCopy.birthdate = "Stryker was here!";
         } else {
             errorsCopy.birthdate = 'Birthdate is Required';

[Survived] BlockStatement
src/components/EmployeeComponent.jsx:157:16
 
         if (birthdate) {
             errorsCopy.birthdate = '';
-        } else {
-            errorsCopy.birthdate = 'Birthdate is Required';
-            valid = false;
-        }
+        } else {}
 
         if (city.trim()) {

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:158:36
         if (birthdate) {
             errorsCopy.birthdate = '';
         } else {
-            errorsCopy.birthdate = 'Birthdate is Required';
+            errorsCopy.birthdate = "";
             valid = false;
         }

[Survived] BooleanLiteral
src/components/EmployeeComponent.jsx:159:21
             errorsCopy.birthdate = '';
         } else {
             errorsCopy.birthdate = 'Birthdate is Required';
-            valid = false;
+            valid = true;
         }
 

[Killed] ConditionalExpression
src/components/EmployeeComponent.jsx:162:13
             valid = false;
         }
 
-        if (city.trim()) {
+        if (false) {
             errorsCopy.city = '';
         } else {
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] MethodExpression
src/components/EmployeeComponent.jsx:162:13
             valid = false;
         }
 
-        if (city.trim()) {
+        if (city) {
             errorsCopy.city = '';
         } else {

[Survived] BlockStatement
src/components/EmployeeComponent.jsx:164:16
 
         if (city.trim()) {
             errorsCopy.city = '';
-        } else {
-            errorsCopy.city = 'City is Required';
-            valid = false;
-        }
+        } else {}
 
         if (state.trim()) {

[Survived] BooleanLiteral
src/components/EmployeeComponent.jsx:166:21
             errorsCopy.city = '';
         } else {
             errorsCopy.city = 'City is Required';
-            valid = false;
+            valid = true;
         }
 

[Killed] ConditionalExpression
src/components/EmployeeComponent.jsx:169:13
             valid = false;
         }
 
-        if (state.trim()) {
+        if (false) {
             errorsCopy.state = '';
         } else {
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] ConditionalExpression
src/components/EmployeeComponent.jsx:169:13
             valid = false;
         }
 
-        if (state.trim()) {
+        if (true) {
             errorsCopy.state = '';
         } else {

[Survived] BlockStatement
src/components/EmployeeComponent.jsx:171:16
 
         if (state.trim()) {
             errorsCopy.state = '';
-        } else {
-            errorsCopy.state = 'State is Required';
-            valid = false;
-        }
+        } else {}
 
         if (pincode.trim()) {

[Survived] BooleanLiteral
src/components/EmployeeComponent.jsx:173:21
             errorsCopy.state = '';
         } else {
             errorsCopy.state = 'State is Required';
-            valid = false;
+            valid = true;
         }
 

[Killed] ConditionalExpression
src/components/EmployeeComponent.jsx:176:13
             valid = false;
         }
 
-        if (pincode.trim()) {
+        if (false) {
             if (pincodePattern.test(pincode)) {
                 errorsCopy.pincode = '';
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] BlockStatement
src/components/EmployeeComponent.jsx:176:29
             valid = false;
         }
 
-        if (pincode.trim()) {
-            if (pincodePattern.test(pincode)) {
-                errorsCopy.pincode = '';
-            } else {
-                errorsCopy.pincode = 'Pincode must be 6 digits';
-                valid = false;
-            }
-        } else {
+        if (pincode.trim()) {} else {
             errorsCopy.pincode = 'Pincode is Required';
             valid = false;

[Killed] ConditionalExpression
src/components/EmployeeComponent.jsx:177:17
         }
 
         if (pincode.trim()) {
-            if (pincodePattern.test(pincode)) {
+            if (false) {
                 errorsCopy.pincode = '';
             } else {
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] ConditionalExpression
src/components/EmployeeComponent.jsx:177:17
         }
 
         if (pincode.trim()) {
-            if (pincodePattern.test(pincode)) {
+            if (true) {
                 errorsCopy.pincode = '';
             } else {

[Survived] BlockStatement
src/components/EmployeeComponent.jsx:179:20
         if (pincode.trim()) {
             if (pincodePattern.test(pincode)) {
                 errorsCopy.pincode = '';
-            } else {
-                errorsCopy.pincode = 'Pincode must be 6 digits';
-                valid = false;
-            }
+            } else {}
         } else {
             errorsCopy.pincode = 'Pincode is Required';

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:180:38
             if (pincodePattern.test(pincode)) {
                 errorsCopy.pincode = '';
             } else {
-                errorsCopy.pincode = 'Pincode must be 6 digits';
+                errorsCopy.pincode = "";
                 valid = false;
             }

[Survived] BooleanLiteral
src/components/EmployeeComponent.jsx:181:25
                 errorsCopy.pincode = '';
             } else {
                 errorsCopy.pincode = 'Pincode must be 6 digits';
-                valid = false;
+                valid = true;
             }
         } else {

[Survived] BlockStatement
src/components/EmployeeComponent.jsx:183:16
                 errorsCopy.pincode = 'Pincode must be 6 digits';
                 valid = false;
             }
-        } else {
-            errorsCopy.pincode = 'Pincode is Required';
-            valid = false;
-        }
+        } else {}
 
         if (emergencyContact.trim()) {

[Survived] BooleanLiteral
src/components/EmployeeComponent.jsx:185:21
             }
         } else {
             errorsCopy.pincode = 'Pincode is Required';
-            valid = false;
+            valid = true;
         }
 

[Killed] ConditionalExpression
src/components/EmployeeComponent.jsx:188:13
             valid = false;
         }
 
-        if (emergencyContact.trim()) {
+        if (false) {
             if (phonePattern.test(emergencyContact)) {
                 errorsCopy.emergencyContact = '';
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] ConditionalExpression
src/components/EmployeeComponent.jsx:188:13
             valid = false;
         }
 
-        if (emergencyContact.trim()) {
+        if (true) {
             if (phonePattern.test(emergencyContact)) {
                 errorsCopy.emergencyContact = '';

[Killed] ConditionalExpression
src/components/EmployeeComponent.jsx:189:17
         }
 
         if (emergencyContact.trim()) {
-            if (phonePattern.test(emergencyContact)) {
+            if (false) {
                 errorsCopy.emergencyContact = '';
             } else {
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] ConditionalExpression
src/components/EmployeeComponent.jsx:189:17
         }
 
         if (emergencyContact.trim()) {
-            if (phonePattern.test(emergencyContact)) {
+            if (true) {
                 errorsCopy.emergencyContact = '';
             } else {

[Survived] BlockStatement
src/components/EmployeeComponent.jsx:191:20
         if (emergencyContact.trim()) {
             if (phonePattern.test(emergencyContact)) {
                 errorsCopy.emergencyContact = '';
-            } else {
-                errorsCopy.emergencyContact = 'Emergency Contact must be 10 digits';
-                valid = false;
-            }
+            } else {}
         } else {
             errorsCopy.emergencyContact = 'Emergency Contact is Required';

[Survived] BooleanLiteral
src/components/EmployeeComponent.jsx:193:25
                 errorsCopy.emergencyContact = '';
             } else {
                 errorsCopy.emergencyContact = 'Emergency Contact must be 10 digits';
-                valid = false;
+                valid = true;
             }
         } else {

[Survived] BlockStatement
src/components/EmployeeComponent.jsx:195:16
                 errorsCopy.emergencyContact = 'Emergency Contact must be 10 digits';
                 valid = false;
             }
-        } else {
-            errorsCopy.emergencyContact = 'Emergency Contact is Required';
-            valid = false;
-        }
+        } else {}
 
         if (employmentType.trim()) {

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:196:43
                 valid = false;
             }
         } else {
-            errorsCopy.emergencyContact = 'Emergency Contact is Required';
+            errorsCopy.emergencyContact = "";
             valid = false;
         }

[Survived] BooleanLiteral
src/components/EmployeeComponent.jsx:197:21
             }
         } else {
             errorsCopy.emergencyContact = 'Emergency Contact is Required';
-            valid = false;
+            valid = true;
         }
 

[Killed] ConditionalExpression
src/components/EmployeeComponent.jsx:200:13
             valid = false;
         }
 
-        if (employmentType.trim()) {
+        if (false) {
             errorsCopy.employmentType = '';
         } else {
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] MethodExpression
src/components/EmployeeComponent.jsx:200:13
             valid = false;
         }
 
-        if (employmentType.trim()) {
+        if (employmentType) {
             errorsCopy.employmentType = '';
         } else {

[Survived] BlockStatement
src/components/EmployeeComponent.jsx:202:16
 
         if (employmentType.trim()) {
             errorsCopy.employmentType = '';
-        } else {
-            errorsCopy.employmentType = 'Employment Type is Required';
-            valid = false;
-        }
+        } else {}
 
         if (startDate) {

[Survived] BooleanLiteral
src/components/EmployeeComponent.jsx:204:21
             errorsCopy.employmentType = '';
         } else {
             errorsCopy.employmentType = 'Employment Type is Required';
-            valid = false;
+            valid = true;
         }
 

[Killed] ConditionalExpression
src/components/EmployeeComponent.jsx:207:13
             valid = false;
         }
 
-        if (startDate) {
+        if (false) {
             errorsCopy.startDate = '';
         } else {
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] ConditionalExpression
src/components/EmployeeComponent.jsx:207:13
             valid = false;
         }
 
-        if (startDate) {
+        if (true) {
             errorsCopy.startDate = '';
         } else {

[Survived] BlockStatement
src/components/EmployeeComponent.jsx:209:16
 
         if (startDate) {
             errorsCopy.startDate = '';
-        } else {
-            errorsCopy.startDate = 'Start Date is Required';
-            valid = false;
-        }
+        } else {}
 
         if (departmentId) {

[Survived] BooleanLiteral
src/components/EmployeeComponent.jsx:211:21
             errorsCopy.startDate = '';
         } else {
             errorsCopy.startDate = 'Start Date is Required';
-            valid = false;
+            valid = true;
         }
 

[Killed] ConditionalExpression
src/components/EmployeeComponent.jsx:214:13
             valid = false;
         }
 
-        if (departmentId) {
+        if (false) {
             errorsCopy.department = '';
         } else {
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] ConditionalExpression
src/components/EmployeeComponent.jsx:214:13
             valid = false;
         }
 
-        if (departmentId) {
+        if (true) {
             errorsCopy.department = '';
         } else {

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:215:37
         }
 
         if (departmentId) {
-            errorsCopy.department = '';
+            errorsCopy.department = "Stryker was here!";
         } else {
             errorsCopy.department = 'Department is Required';

[Survived] BlockStatement
src/components/EmployeeComponent.jsx:216:16
 
         if (departmentId) {
             errorsCopy.department = '';
-        } else {
-            errorsCopy.department = 'Department is Required';
-            valid = false;
-        }
+        } else {}
 
         setErrors(errorsCopy);

[Survived] BooleanLiteral
src/components/EmployeeComponent.jsx:218:21
             errorsCopy.department = '';
         } else {
             errorsCopy.department = 'Department is Required';
-            valid = false;
+            valid = true;
         }
 

[Survived] BlockStatement
src/components/EmployeeComponent.jsx:225:29
         return valid;
     };
 
-    const pageTitle = () => {
-        if (id) {
-            return <h2 className='text-center'> Update Employees </h2>;
-        } else {
-            return <h2 className='text-center'> Add Employees </h2>;
-        }
-    };
+    const pageTitle = () => {};
 
     return (

[Survived] BlockStatement
src/components/EmployeeComponent.jsx:226:17
     };
 
     const pageTitle = () => {
-        if (id) {
-            return <h2 className='text-center'> Update Employees </h2>;
-        } else {
+        if (id) {} else {
             return <h2 className='text-center'> Add Employees </h2>;
         }

[Survived] ConditionalExpression
src/components/EmployeeComponent.jsx:226:13
     };
 
     const pageTitle = () => {
-        if (id) {
+        if (true) {
             return <h2 className='text-center'> Update Employees </h2>;
         } else {

[Timeout] BlockStatement
src/components/EmployeeComponent.jsx:228:16
     const pageTitle = () => {
         if (id) {
             return <h2 className='text-center'> Update Employees </h2>;
-        } else {
-            return <h2 className='text-center'> Add Employees </h2>;
-        }
+        } else {}
     };
 

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:248:83
                                     placeholder='Enter First Name'
                                     name='firstName'
                                     value={firstName}
-                                    className={`form-control ${errors.firstName ? 'is-invalid' : ''}`}
+                                    className={`form-control ${errors.firstName ? "" : ''}`}
                                     onChange={(e) => handleChange(e, setFirstName)}
                                 />

[Killed] ArrowFunction
src/components/EmployeeComponent.jsx:249:47
                                     name='firstName'
                                     value={firstName}
                                     className={`form-control ${errors.firstName ? 'is-invalid' : ''}`}
-                                    onChange={(e) => handleChange(e, setFirstName)}
+                                    onChange={() => undefined}
                                 />
                                 {errors.firstName && <div className='invalid-feedback'>{errors.firstName}</div>}
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] LogicalOperator
src/components/EmployeeComponent.jsx:251:34
                                     className={`form-control ${errors.firstName ? 'is-invalid' : ''}`}
                                     onChange={(e) => handleChange(e, setFirstName)}
                                 />
-                                {errors.firstName && <div className='invalid-feedback'>{errors.firstName}</div>}
+                                {errors.firstName || <div className='invalid-feedback'>{errors.firstName}</div>}
                             </div>
 

[Survived] ConditionalExpression
src/components/EmployeeComponent.jsx:251:34
                                     className={`form-control ${errors.firstName ? 'is-invalid' : ''}`}
                                     onChange={(e) => handleChange(e, setFirstName)}
                                 />
-                                {errors.firstName && <div className='invalid-feedback'>{errors.firstName}</div>}
+                                {true}
                             </div>
 

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:261:48
                                     placeholder='Enter Last Name'
                                     name='lastName'
                                     value={lastName}
-                                    className={`form-control ${errors.lastName ? 'is-invalid' : ''}`}
+                                    className={``}
                                     onChange={(e) => handleChange(e, setLastName)}
                                 />

[Killed] ArrowFunction
src/components/EmployeeComponent.jsx:262:47
                                     name='lastName'
                                     value={lastName}
                                     className={`form-control ${errors.lastName ? 'is-invalid' : ''}`}
-                                    onChange={(e) => handleChange(e, setLastName)}
+                                    onChange={() => undefined}
                                 />
                                 {errors.lastName && <div className='invalid-feedback'>{errors.lastName}</div>}
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] LogicalOperator
src/components/EmployeeComponent.jsx:264:34
                                     className={`form-control ${errors.lastName ? 'is-invalid' : ''}`}
                                     onChange={(e) => handleChange(e, setLastName)}
                                 />
-                                {errors.lastName && <div className='invalid-feedback'>{errors.lastName}</div>}
+                                {errors.lastName || <div className='invalid-feedback'>{errors.lastName}</div>}
                             </div>
 

[Survived] ConditionalExpression
src/components/EmployeeComponent.jsx:264:34
                                     className={`form-control ${errors.lastName ? 'is-invalid' : ''}`}
                                     onChange={(e) => handleChange(e, setLastName)}
                                 />
-                                {errors.lastName && <div className='invalid-feedback'>{errors.lastName}</div>}
+                                {true}
                             </div>
 

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:274:94
                                     placeholder='Enter Email'
                                     name='email'
                                     value={email}
-                                    className={`form-control ${errors.email ? 'is-invalid' : ''}`}
+                                    className={`form-control ${errors.email ? 'is-invalid' : "Stryker was here!"}`}
                                     onChange={(e) => handleChange(e, setEmail)}
                                 />

[Killed] ArrowFunction
src/components/EmployeeComponent.jsx:275:47
                                     name='email'
                                     value={email}
                                     className={`form-control ${errors.email ? 'is-invalid' : ''}`}
-                                    onChange={(e) => handleChange(e, setEmail)}
+                                    onChange={() => undefined}
                                 />
                                 {errors.email && <div className='invalid-feedback'>{errors.email}</div>}
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
src/components/EmployeeComponent.jsx:277:34
                                     className={`form-control ${errors.email ? 'is-invalid' : ''}`}
                                     onChange={(e) => handleChange(e, setEmail)}
                                 />
-                                {errors.email && <div className='invalid-feedback'>{errors.email}</div>}
+                                {true}
                             </div>
 
killedBy: EmployeeComponent Tests does not call API if form data is invalid
statusReason: Error: Unable to find an element with the text: function (content, element) { return content.includes('Email is Required') || content.includes('Email must contain "@" and "."'); } (normalized from 'function (content, element) {
            return content.includes('Email is Required') || content.includes('Email must contain "@" and "."');
          }'). This could be because the text is broken up b

[Killed] ConditionalExpression
src/components/EmployeeComponent.jsx:277:34
                                     className={`form-control ${errors.email ? 'is-invalid' : ''}`}
                                     onChange={(e) => handleChange(e, setEmail)}
                                 />
-                                {errors.email && <div className='invalid-feedback'>{errors.email}</div>}
+                                {false}
                             </div>
 
killedBy: EmployeeComponent Tests does not call API if form data is invalid
statusReason: Error: Unable to find an element with the text: function (content, element) { return content.includes('Email is Required') || content.includes('Email must contain "@" and "."'); } (normalized from 'function (content, element) {
            return content.includes('Email is Required') || content.includes('Email must contain "@" and "."');
          }'). This could be because the text is broken up b

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:284:95
                                 <label className='form-label'>Gender</label>
                                 <select
                                     data-testid="gender-select"
-                                    className={`form-control ${errors.gender ? 'is-invalid' : ''}`}
+                                    className={`form-control ${errors.gender ? 'is-invalid' : "Stryker was here!"}`}
                                     value={gender}
                                     onChange={(e) => handleChange(e, setGender)}

[Killed] ArrowFunction
src/components/EmployeeComponent.jsx:286:47
                                     data-testid="gender-select"
                                     className={`form-control ${errors.gender ? 'is-invalid' : ''}`}
                                     value={gender}
-                                    onChange={(e) => handleChange(e, setGender)}
+                                    onChange={() => undefined}
                                 >
                                     <option value=''>Select Gender</option>
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] ConditionalExpression
src/components/EmployeeComponent.jsx:293:34
                                     <option value='Female'>Female</option>
                                     <option value='Other'>Other</option>
                                 </select>
-                                {errors.gender && <div className='invalid-feedback'>{errors.gender}</div>}
+                                {true}
                             </div>
 

[Survived] LogicalOperator
src/components/EmployeeComponent.jsx:293:34
                                     <option value='Female'>Female</option>
                                     <option value='Other'>Other</option>
                                 </select>
-                                {errors.gender && <div className='invalid-feedback'>{errors.gender}</div>}
+                                {errors.gender || <div className='invalid-feedback'>{errors.gender}</div>}
                             </div>
 

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:303:48
                                     placeholder='Enter Phone Number'
                                     name='phoneNumber'
                                     value={phoneNumber}
-                                    className={`form-control ${errors.phoneNumber ? 'is-invalid' : ''}`}
+                                    className={``}
                                     onChange={(e) => handleChange(e, setPhoneNumber)}
                                 />

[Killed] ArrowFunction
src/components/EmployeeComponent.jsx:304:47
                                     name='phoneNumber'
                                     value={phoneNumber}
                                     className={`form-control ${errors.phoneNumber ? 'is-invalid' : ''}`}
-                                    onChange={(e) => handleChange(e, setPhoneNumber)}
+                                    onChange={() => undefined}
                                 />
                                 {errors.phoneNumber && <div className='invalid-feedback'>{errors.phoneNumber}</div>}
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] ConditionalExpression
src/components/EmployeeComponent.jsx:306:34
                                     className={`form-control ${errors.phoneNumber ? 'is-invalid' : ''}`}
                                     onChange={(e) => handleChange(e, setPhoneNumber)}
                                 />
-                                {errors.phoneNumber && <div className='invalid-feedback'>{errors.phoneNumber}</div>}
+                                {true}
                             </div>
 

[Survived] ConditionalExpression
src/components/EmployeeComponent.jsx:306:34
                                     className={`form-control ${errors.phoneNumber ? 'is-invalid' : ''}`}
                                     onChange={(e) => handleChange(e, setPhoneNumber)}
                                 />
-                                {errors.phoneNumber && <div className='invalid-feedback'>{errors.phoneNumber}</div>}
+                                {false}
                             </div>
 
