[Killed] ArrowFunction
src/components/EmployeeComponent.jsx:317:47
                                     name='birthdate'
                                     value={birthdate}
                                     className={`form-control ${errors.birthdate ? 'is-invalid' : ''}`}
-                                    onChange={(e) => handleChange(e, setBirthdate)}
+                                    onChange={() => undefined}
                                 />
                                 {errors.birthdate && <div className='invalid-feedback'>{errors.birthdate}</div>}
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] ConditionalExpression
src/components/EmployeeComponent.jsx:319:34
                                     className={`form-control ${errors.birthdate ? 'is-invalid' : ''}`}
                                     onChange={(e) => handleChange(e, setBirthdate)}
                                 />
-                                {errors.birthdate && <div className='invalid-feedback'>{errors.birthdate}</div>}
+                                {true}
                             </div>
 

[Survived] LogicalOperator
src/components/EmployeeComponent.jsx:319:34
                                     className={`form-control ${errors.birthdate ? 'is-invalid' : ''}`}
                                     onChange={(e) => handleChange(e, setBirthdate)}
                                 />
-                                {errors.birthdate && <div className='invalid-feedback'>{errors.birthdate}</div>}
+                                {errors.birthdate || <div className='invalid-feedback'>{errors.birthdate}</div>}
                             </div>
 

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:329:48
                                     placeholder='Enter City'
                                     name='city'
                                     value={city}
-                                    className={`form-control ${errors.city ? 'is-invalid' : ''}`}
+                                    className={``}
                                     onChange={(e) => handleChange(e, setCity)}
                                 />

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:329:78
                                     placeholder='Enter City'
                                     name='city'
                                     value={city}
-                                    className={`form-control ${errors.city ? 'is-invalid' : ''}`}
+                                    className={`form-control ${errors.city ? "" : ''}`}
                                     onChange={(e) => handleChange(e, setCity)}
                                 />

[Killed] ArrowFunction
src/components/EmployeeComponent.jsx:330:47
                                     name='city'
                                     value={city}
                                     className={`form-control ${errors.city ? 'is-invalid' : ''}`}
-                                    onChange={(e) => handleChange(e, setCity)}
+                                    onChange={() => undefined}
                                 />
                                 {errors.city && <div className='invalid-feedback'>{errors.city}</div>}
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] ConditionalExpression
src/components/EmployeeComponent.jsx:332:34
                                     className={`form-control ${errors.city ? 'is-invalid' : ''}`}
                                     onChange={(e) => handleChange(e, setCity)}
                                 />
-                                {errors.city && <div className='invalid-feedback'>{errors.city}</div>}
+                                {false}
                             </div>
 

[Survived] ConditionalExpression
src/components/EmployeeComponent.jsx:332:34
                                     className={`form-control ${errors.city ? 'is-invalid' : ''}`}
                                     onChange={(e) => handleChange(e, setCity)}
                                 />
-                                {errors.city && <div className='invalid-feedback'>{errors.city}</div>}
+                                {true}
                             </div>
 

[Killed] ArrowFunction
src/components/EmployeeComponent.jsx:343:47
                                     name='state'
                                     value={state}
                                     className={`form-control ${errors.state ? 'is-invalid' : ''}`}
-                                    onChange={(e) => handleChange(e, setState)}
+                                    onChange={() => undefined}
                                 />
                                 {errors.state && <div className='invalid-feedback'>{errors.state}</div>}
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Timeout] LogicalOperator
src/components/EmployeeComponent.jsx:345:34
                                     className={`form-control ${errors.state ? 'is-invalid' : ''}`}
                                     onChange={(e) => handleChange(e, setState)}
                                 />
-                                {errors.state && <div className='invalid-feedback'>{errors.state}</div>}
+                                {errors.state || <div className='invalid-feedback'>{errors.state}</div>}
                             </div>
 

[Survived] ConditionalExpression
src/components/EmployeeComponent.jsx:345:34
                                     className={`form-control ${errors.state ? 'is-invalid' : ''}`}
                                     onChange={(e) => handleChange(e, setState)}
                                 />
-                                {errors.state && <div className='invalid-feedback'>{errors.state}</div>}
+                                {true}
                             </div>
 

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:355:48
                                     placeholder='Enter Pincode'
                                     name='pincode'
                                     value={pincode}
-                                    className={`form-control ${errors.pincode ? 'is-invalid' : ''}`}
+                                    className={``}
                                     onChange={(e) => handleChange(e, setPincode)}
                                 />

[Killed] ArrowFunction
src/components/EmployeeComponent.jsx:356:47
                                     name='pincode'
                                     value={pincode}
                                     className={`form-control ${errors.pincode ? 'is-invalid' : ''}`}
-                                    onChange={(e) => handleChange(e, setPincode)}
+                                    onChange={() => undefined}
                                 />
                                 {errors.pincode && <div className='invalid-feedback'>{errors.pincode}</div>}
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] LogicalOperator
src/components/EmployeeComponent.jsx:358:34
                                     className={`form-control ${errors.pincode ? 'is-invalid' : ''}`}
                                     onChange={(e) => handleChange(e, setPincode)}
                                 />
-                                {errors.pincode && <div className='invalid-feedback'>{errors.pincode}</div>}
+                                {errors.pincode || <div className='invalid-feedback'>{errors.pincode}</div>}
                             </div>
 

[Survived] ConditionalExpression
src/components/EmployeeComponent.jsx:358:34
                                     className={`form-control ${errors.pincode ? 'is-invalid' : ''}`}
                                     onChange={(e) => handleChange(e, setPincode)}
                                 />
-                                {errors.pincode && <div className='invalid-feedback'>{errors.pincode}</div>}
+                                {true}
                             </div>
 

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:368:48
                                     placeholder='Enter Emergency Contact Number'
                                     name='emergencyContact'
                                     value={emergencyContact}
-                                    className={`form-control ${errors.emergencyContact ? 'is-invalid' : ''}`}
+                                    className={``}
                                     onChange={(e) => handleChange(e, setEmergencyContact)}
                                 />

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:368:105
                                     placeholder='Enter Emergency Contact Number'
                                     name='emergencyContact'
                                     value={emergencyContact}
-                                    className={`form-control ${errors.emergencyContact ? 'is-invalid' : ''}`}
+                                    className={`form-control ${errors.emergencyContact ? 'is-invalid' : "Stryker was here!"}`}
                                     onChange={(e) => handleChange(e, setEmergencyContact)}
                                 />

[Killed] ArrowFunction
src/components/EmployeeComponent.jsx:369:47
                                     name='emergencyContact'
                                     value={emergencyContact}
                                     className={`form-control ${errors.emergencyContact ? 'is-invalid' : ''}`}
-                                    onChange={(e) => handleChange(e, setEmergencyContact)}
+                                    onChange={() => undefined}
                                 />
                                 {errors.emergencyContact && <div className='invalid-feedback'>{errors.emergencyContact}</div>}
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] ConditionalExpression
src/components/EmployeeComponent.jsx:371:34
                                     className={`form-control ${errors.emergencyContact ? 'is-invalid' : ''}`}
                                     onChange={(e) => handleChange(e, setEmergencyContact)}
                                 />
-                                {errors.emergencyContact && <div className='invalid-feedback'>{errors.emergencyContact}</div>}
+                                {false}
                             </div>
 

[Survived] ConditionalExpression
src/components/EmployeeComponent.jsx:371:34
                                     className={`form-control ${errors.emergencyContact ? 'is-invalid' : ''}`}
                                     onChange={(e) => handleChange(e, setEmergencyContact)}
                                 />
-                                {errors.emergencyContact && <div className='invalid-feedback'>{errors.emergencyContact}</div>}
+                                {true}
                             </div>
 

[Killed] ArrowFunction
src/components/EmployeeComponent.jsx:380:47
                                     data-testid="Employment Type"
                                     className={`form-control ${errors.employmentType ? 'is-invalid' : ''}`}
                                     value={employmentType}
-                                    onChange={(e) => handleChange(e, setEmploymentType)}
+                                    onChange={() => undefined}
                                 >
                                     <option value=''>Select Employment Type</option>
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] ConditionalExpression
src/components/EmployeeComponent.jsx:387:34
                                     <option value='Part-Time'>Part-Time</option>
                                     <option value='Contract'>Contract</option>
                                 </select>
-                                {errors.employmentType && <div className='invalid-feedback'>{errors.employmentType}</div>}
+                                {true}
                             </div>
 

[Survived] ConditionalExpression
src/components/EmployeeComponent.jsx:387:34
                                     <option value='Part-Time'>Part-Time</option>
                                     <option value='Contract'>Contract</option>
                                 </select>
-                                {errors.employmentType && <div className='invalid-feedback'>{errors.employmentType}</div>}
+                                {false}
                             </div>
 

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:397:48
                                     type='month'
                                     name='startDate'
                                     value={startDate}
-                                    className={`form-control ${errors.startDate ? 'is-invalid' : ''}`}
+                                    className={``}
                                     onChange={(e) => handleChange(e, setStartDate)}
                                 />

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:397:98
                                     type='month'
                                     name='startDate'
                                     value={startDate}
-                                    className={`form-control ${errors.startDate ? 'is-invalid' : ''}`}
+                                    className={`form-control ${errors.startDate ? 'is-invalid' : "Stryker was here!"}`}
                                     onChange={(e) => handleChange(e, setStartDate)}
                                 />

[Killed] ArrowFunction
src/components/EmployeeComponent.jsx:398:47
                                     name='startDate'
                                     value={startDate}
                                     className={`form-control ${errors.startDate ? 'is-invalid' : ''}`}
-                                    onChange={(e) => handleChange(e, setStartDate)}
+                                    onChange={() => undefined}
                                 />
                                 {errors.startDate && <div className='invalid-feedback'>{errors.startDate}</div>}
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] LogicalOperator
src/components/EmployeeComponent.jsx:400:34
                                     className={`form-control ${errors.startDate ? 'is-invalid' : ''}`}
                                     onChange={(e) => handleChange(e, setStartDate)}
                                 />
-                                {errors.startDate && <div className='invalid-feedback'>{errors.startDate}</div>}
+                                {errors.startDate || <div className='invalid-feedback'>{errors.startDate}</div>}
                             </div>
 

[Survived] ConditionalExpression
src/components/EmployeeComponent.jsx:400:34
                                     className={`form-control ${errors.startDate ? 'is-invalid' : ''}`}
                                     onChange={(e) => handleChange(e, setStartDate)}
                                 />
-                                {errors.startDate && <div className='invalid-feedback'>{errors.startDate}</div>}
+                                {true}
                             </div>
 

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:408:84
                                 <select
                                     data-testid="department-select" 
                                     id="department-select"  
-                                    className={`form-control ${errors.department ? 'is-invalid' : ''}`}
+                                    className={`form-control ${errors.department ? "" : ''}`}
                                     value={departmentId}
                                     onChange={(e) => setDepartmentId(e.target.value)}

[Survived] StringLiteral
src/components/EmployeeComponent.jsx:408:99
                                 <select
                                     data-testid="department-select" 
                                     id="department-select"  
-                                    className={`form-control ${errors.department ? 'is-invalid' : ''}`}
+                                    className={`form-control ${errors.department ? 'is-invalid' : "Stryker was here!"}`}
                                     value={departmentId}
                                     onChange={(e) => setDepartmentId(e.target.value)}

[Killed] ArrowFunction
src/components/EmployeeComponent.jsx:410:47
                                     id="department-select"  
                                     className={`form-control ${errors.department ? 'is-invalid' : ''}`}
                                     value={departmentId}
-                                    onChange={(e) => setDepartmentId(e.target.value)}
+                                    onChange={() => undefined}
                                 >
                                     <option value=''>Select Department</option>
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ArrowFunction
src/components/EmployeeComponent.jsx:413:54
                                     onChange={(e) => setDepartmentId(e.target.value)}
                                 >
                                     <option value=''>Select Department</option>
-                                    {departments.map(department =>
-                                        <option key={department.id} value={department.id}>
-                                            {department.departmentName}
-                                        </option>
+                                    {departments.map(() => undefined
                                     )}
                                 </select>
killedBy: EmployeeComponent Tests submits form with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] ConditionalExpression
src/components/EmployeeComponent.jsx:419:34
                                         </option>
                                     )}
                                 </select>
-                                {errors.department && <div className='invalid-feedback'>{errors.department}</div>}
+                                {true}
                             </div>
 

[Survived] LogicalOperator
src/components/EmployeeComponent.jsx:419:34
                                         </option>
                                     )}
                                 </select>
-                                {errors.department && <div className='invalid-feedback'>{errors.department}</div>}
+                                {errors.department || <div className='invalid-feedback'>{errors.department}</div>}
                             </div>
 
