[Survived] BlockStatement
src/components/FooterComponent.jsx:3:38
 import React from 'react'
 
-export const FooterComponent = () => {
-  return (
-    <div>
-        {/* <footer className='footer'>
-            <span></span>
-
-        </footer> */}
-
-    </div>
-  )
-}
+export const FooterComponent = () => {}
 
