[Survived] StringLiteral
src/main.jsx:7:45
 import './index.css'
 import 'bootstrap/dist/css/bootstrap.min.css'
 
-ReactDOM.createRoot(document.getElementById('root')).render(
+ReactDOM.createRoot(document.getElementById("")).render(
   <React.StrictMode>
     <App />
